Repository: fieldOfView/Cura-MeshTools
Catalog: resources/i18n/*/meshtools.po
Languages: fr_fr

# @item:inmenu
source: Reload model
fr_fr: Recharger le modèle

# @item:inmenu
source: Rename model...
fr_fr: Renommer modèle...

# @item:inmenu
source: Replace models...
fr_fr: Remplacer modèles...

# @item:inmenu
source: Check models
fr_fr: Vérifier les modèles

# @item:inmenu
source: Analyse models
fr_fr: Analyser les modèles

# @item:inmenu
source: Fix simple holes
fr_fr: Boucher les trous simples

# @item:inmenu
source: Fix model normals
fr_fr: Recalculer les normales du modèle

# @item:inmenu
source: Split model into parts
fr_fr: Diviser le modèle en plusieurs parties

# @item:inmenu
source: Randomise location
fr_fr: Localisation aléatoire

# @item:inmenu
source: Fixed location
fr_fr: Position déterminée

# @item:inmenu
source: Apply transformations to mesh
fr_fr: Appliquer les transformations au maillage

# @item:inmenu
source: Reset origin to center of mesh
fr_fr: Remettre l'origine au centre du maillage

# @item:inmenu
source: Mesh Tools settings...
fr_fr: Paramètres de Mesh Tools...

# @info:status
source: Randomise Location fixed by Mesh Tools
fr_fr: Placement aléatoire par Mesh Tools

# @info:status
source: Location fixed by Mesh Tools
fr_fr: Placement fixé par Mesh Tools

# @text Print job name
source: Untitled
fr_fr: Sans Nom

# @info:status
source: Model %s is not watertight, and may not print properly.
fr_fr: Le modèle %s n'est pas étanche et risque de ne pas s'imprimer correctement.

# @info:status
source: Check X-Ray View and repair the model before printing it.
fr_fr: Vérifiez la vue aux Rayons-X et réparez le modèle avant de l'imprimer.

# @action:button
source: Show X-Ray View
fr_fr: Afficher la vue aux Rayons-X

# @info:status
source: Repair the model before printing it.
fr_fr: Réparez le modèle avant de l'imprimer.

# @info:status
source: Please select a single model first
fr_fr: Sélectionnez tout d'abord une pièce

# @info:status
source: Please select one or more models first
fr_fr: Sélectionnez tout d'abord des pièces

# @info:status
source: Check summary:
fr_fr: Résumé de la vérification :

# @info:status
source: is watertight
fr_fr: est étanche

# @info:status
source: is not watertight and may not print properly
fr_fr: n'est pas étanche et peut ne pas imprimer correctement

# @info:status
source: and consists of {body_count} submeshes
fr_fr: et consiste en {body_count} sous-ensembles

# @info:status
source: Analysis summary:
fr_fr: Résumé de l'analyse :

# @info:status
source: %d vertices, %d faces
fr_fr: %d sommets, %d faces

# @info:status
source: area: %d mm2, volume: %d mm3
fr_fr: surface: %d mm2, volume: %d mm3

# @info:status
source: The mesh needs more extensive repair to become watertight
fr_fr: La maille a besoin de réparations plus importantes pour devenir étanche.

# @info:status
source: Split result:
fr_fr: Résultat du fractionnement :

# @info:status
source: was split in %d submeshes
fr_fr: a été divisé en %d sous-maillages

# @info:status
source: could not be split into submeshes
fr_fr: n'a pas pu être divisé en sous-ensembles

# @info:status
source: Replacing a group is not supported
fr_fr: Le remplacement d'un groupe n'est pas pris en charge

# @title:window
source: Select Replacement Mesh File
fr_fr: Sélectionnez le fichier de maillage de remplacement

# @info:status
source: Reloading a group is not supported
fr_fr: Le rechargement d'un groupe n'est pas pris en charge

# @info:status
source: No link to the original file was found
fr_fr: Aucun lien vers le fichier original n'a été trouvé

# @info:status
source: Failed to load mesh
fr_fr: Échec du chargement du maillage

# @info:status
source: Replacing meshes with a group of meshes is not supported
fr_fr: Le remplacement des maillages par un groupe de maillages n'est pas pris en charge.

# @title:window
source: Mesh Tools Settings
fr_fr: Paramètres du plugin

# @info:tooltip
source: Check if models are watertight when loading them
fr_fr: Vérifier l'étanchéité des modèles lors de leur chargement

# @option:check
source: Check models on load
fr_fr: Vérifier les modèles au chargement

# @info:tooltip
source: Always recalculate model normals when loading them
fr_fr: Toujours recalculer les normales des modèles lors de leur chargement

# @option:check
source: Fix normals on load
fr_fr: Corriger les normales au chargement

# @info:tooltip
source: Unit to convert meshes from when the file does not specify a unit (such as STL files). All units will be converted to millimeters.
fr_fr: Unité à partir de laquelle convertir les mailles lorsque le fichier ne spécifie pas d'unité (comme les fichiers STL). Toutes les unités seront converties en millimètres.

# @window:text
source: Unit for files that don't specify a unit:
fr_fr: Unité pour les fichiers qui ne spécifient pas d'unité :

# @option:unit
source: Millimeter (default)
fr_fr: Millimètre (défaut)

# @option:unit
source: Centimeter
fr_fr: Centimètre

# @option:unit
source: Meter
fr_fr: Mètre

# @option:unit
source: Inch
fr_fr: Pouce

# @option:unit
source: Feet
fr_fr: Pied

# @info:tooltip
source: Place models at a random location on the build plate when loading them
fr_fr: Placez les modèles à une position aléatoire sur le plateau d'impression lorsque vous les chargez.

# @option:check
source: Randomize position on load
fr_fr: Position aléatoire au chargement

# @info:tooltip
source: Place models at a specific location on the build plate when loading them
fr_fr: Placer les modèles à un endroit précis de la plaque de construction lors de leur chargement.

# @option:check
source: Set position on load
fr_fr: Position au chargement

# @info:tooltip
source: X position relative / Bed Center
fr_fr: Position X relative / Centre du plateau

# @label:text
source: X position
fr_fr: Position X

# @info:tooltip
source: Y position relative / Bed Center
fr_fr: Position Y relative / Centre du plateau

# @label:text
source: Y position
fr_fr: Position Y

# @action:button
source: Close
fr_fr: Fermer

# @title:window
source: Rename
fr_fr: Renommer

# @info
source: Please provide a new name.
fr_fr: Veuillez indiquer un nouveau nom.

# @action:button
source: Cancel
fr_fr: Annuler

# @item:inmenu
source: Replace model...
fr_fr: Remplacer modèle...

# @item:inmenu
source: Check mesh
fr_fr: Vérifier le maillage

# @item:inmenu
source: Analyse mesh
fr_fr: Analyser maillage
